In [12]:
import pandas as pd 
import getpass
import json
import os
import requests
import re

In [13]:
df = pd.read_csv('./INPUT/avocado.csv', encoding = "cp1252")

In [14]:
df.head(10)

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
0,0,2015-12-27,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,conventional,2015,Albany
1,1,2015-12-20,1.35,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.0,conventional,2015,Albany
2,2,2015-12-13,0.93,118220.22,794.70,109149.67,130.50,8145.35,8042.21,103.14,0.0,conventional,2015,Albany
3,3,2015-12-06,1.08,78992.15,1132.00,71976.41,72.58,5811.16,5677.40,133.76,0.0,conventional,2015,Albany
4,4,2015-11-29,1.28,51039.60,941.48,43838.39,75.78,6183.95,5986.26,197.69,0.0,conventional,2015,Albany
5,5,2015-11-22,1.26,55979.78,1184.27,48067.99,43.61,6683.91,6556.47,127.44,0.0,conventional,2015,Albany
6,6,2015-11-15,0.99,83453.76,1368.92,73672.72,93.26,8318.86,8196.81,122.05,0.0,conventional,2015,Albany
7,7,2015-11-08,0.98,109428.33,703.75,101815.36,80.00,6829.22,6266.85,562.37,0.0,conventional,2015,Albany
8,8,2015-11-01,1.02,99811.42,1022.15,87315.57,85.34,11388.36,11104.53,283.83,0.0,conventional,2015,Albany
9,9,2015-10-25,1.07,74338.76,842.40,64757.44,113.00,8625.92,8061.47,564.45,0.0,conventional,2015,Albany

In [15]:
len(df.columns)

14

In [16]:
df.shape

(18249, 14)

In [17]:
df.columns

Index(['Unnamed: 0', 'Date', 'AveragePrice', 'Total Volume', '4046', '4225',
       '4770', 'Total Bags', 'Small Bags', 'Large Bags', 'XLarge Bags', 'type',
       'year', 'region'],
      dtype='object')

In [18]:
regions=set(df['region'])

In [19]:
len(regions)

54

In [20]:
df=df.drop(['4046','4225','4770','Total Bags', 'Small Bags', 'Large Bags', 'XLarge Bags'],axis=1)

In [21]:
df.head(10)

,Unnamed: 0,Date,AveragePrice,Total Volume,type,year,region
0,0,2015-12-27,1.33,64236.62,conventional,2015,Albany
1,1,2015-12-20,1.35,54876.98,conventional,2015,Albany
2,2,2015-12-13,0.93,118220.22,conventional,2015,Albany
3,3,2015-12-06,1.08,78992.15,conventional,2015,Albany
4,4,2015-11-29,1.28,51039.60,conventional,2015,Albany
5,5,2015-11-22,1.26,55979.78,conventional,2015,Albany
6,6,2015-11-15,0.99,83453.76,conventional,2015,Albany
7,7,2015-11-08,0.98,109428.33,conventional,2015,Albany
8,8,2015-11-01,1.02,99811.42,conventional,2015,Albany
9,9,2015-10-25,1.07,74338.76,conventional,2015,Albany

In [22]:
len(set(df['Unnamed: 0']))

53

In [23]:
df=df.rename(columns={'Unnamed: 0': 'id'})

In [24]:
r=df[(df.Date=='2015-10-25') & (df.region=='Albany') & (df.type=='conventional')]

In [25]:
r

   id        Date  AveragePrice  Total Volume          type  year  region
9   9  2015-10-25          1.07      74338.76  conventional  2015  Albany

In [26]:
data=[]
data.append(r['AveragePrice'].item())
data.append(r['Total Volume'].item())
data

/usr/local/lib/python3.7/site-packages/ipykernel_launcher.py:2: FutureWarning: `item` has been deprecated and will be removed in a future version

/usr/local/lib/python3.7/site-packages/ipykernel_launcher.py:3: FutureWarning: `item` has been deprecated and will be removed in a future version
  This is separate from the ipykernel package so we can avoid doing imports until

[1.07, 74338.76]

In [27]:
lr=df['region']
for r in range(len(lr)):
    palabras=re.findall('[A-Z][^A-Z]*', lr[r])
    lr[r]=" ".join(palabras)

/usr/local/lib/python3.7/site-packages/ipykernel_launcher.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  after removing the cwd from sys.path.

In [28]:
df['region']=list(lr)

In [30]:
display(df)

,id,Date,AveragePrice,Total Volume,type,year,region
0,0,2015-12-27,1.33,64236.62,conventional,2015,Albany
1,1,2015-12-20,1.35,54876.98,conventional,2015,Albany
2,2,2015-12-13,0.93,118220.22,conventional,2015,Albany
3,3,2015-12-06,1.08,78992.15,conventional,2015,Albany
4,4,2015-11-29,1.28,51039.60,conventional,2015,Albany
...,...,...,...,...,...,...,...
18244,7,2018-02-04,1.63,17074.83,organic,2018,West Tex New Mexico
18245,8,2018-01-28,1.71,13888.04,organic,2018,West Tex New Mexico
18246,9,2018-01-21,1.87,13766.76,organic,2018,West Tex New Mexico
18247,10,2018-01-14,1.93,16205.22,organic,2018,West Tex New Mexico
18248,11,2018-01-07,1.62,17489.58,organic,2018,West Tex New Mexico

In [31]:
set(df['region'])

{'Albany',
 'Atlanta',
 'Baltimore Washington',
 'Boise',
 'Boston',
 'Buffalo Rochester',
 'California',
 'Charlotte',
 'Chicago',
 'Cincinnati Dayton',
 'Columbus',
 'Dallas Ft Worth',
 'Denver',
 'Detroit',
 'Grand Rapids',
 'Great Lakes',
 'Harrisburg Scranton',
 'Hartford Springfield',
 'Houston',
 'Indianapolis',
 'Jacksonville',
 'Las Vegas',
 'Los Angeles',
 'Louisville',
 'Miami Ft Lauderdale',
 'Midsouth',
 'Nashville',
 'New Orleans Mobile',
 'New York',
 'Northeast',
 'Northern New England',
 'Orlando',
 'Philadelphia',
 'Phoenix Tucson',
 'Pittsburgh',
 'Plains',
 'Portland',
 'Raleigh Greensboro',
 'Richmond Norfolk',
 'Roanoke',
 'Sacramento',
 'San Diego',
 'San Francisco',
 'Seattle',
 'South Carolina',
 'South Central',
 'Southeast',
 'Spokane',
 'St Louis',
 'Syracuse',
 'Tampa',
 'Total U S',
 'West',
 'West Tex New Mexico'}

In [32]:
df.loc[(df["region"]=='West Tex New Mexico'), "region"] = 'New Mexico'

In [33]:
df[(df.region=='Total U S')]

,id,Date,AveragePrice,Total Volume,type,year,region
2652,0,2015-12-27,0.95,27297983.67,conventional,2015,Total U S
2653,1,2015-12-20,0.98,25083647.17,conventional,2015,Total U S
2654,2,2015-12-13,0.93,28041335.38,conventional,2015,Total U S
2655,3,2015-12-06,0.89,28800396.57,conventional,2015,Total U S
2656,4,2015-11-29,0.99,22617999.38,conventional,2015,Total U S
...,...,...,...,...,...,...,...
18220,7,2018-02-04,1.53,1384683.41,organic,2018,Total U S
18221,8,2018-01-28,1.61,1336979.09,organic,2018,Total U S
18222,9,2018-01-21,1.63,1283987.65,organic,2018,Total U S
18223,10,2018-01-14,1.59,1476651.08,organic,2018,Total U S
18224,11,2018-01-07,1.51,1517332.70,organic,2018,Total U S

In [35]:
len(set(df['Date']))

169

In [37]:
set(df['region'])

{'Albany',
 'Atlanta',
 'Baltimore Washington',
 'Boise',
 'Boston',
 'Buffalo Rochester',
 'California',
 'Charlotte',
 'Chicago',
 'Cincinnati Dayton',
 'Columbus',
 'Dallas Ft Worth',
 'Denver',
 'Detroit',
 'Grand Rapids',
 'Great Lakes',
 'Harrisburg Scranton',
 'Hartford Springfield',
 'Houston',
 'Indianapolis',
 'Jacksonville',
 'Las Vegas',
 'Los Angeles',
 'Louisville',
 'Miami Ft Lauderdale',
 'Midsouth',
 'Nashville',
 'New Mexico',
 'New Orleans Mobile',
 'New York',
 'Northeast',
 'Northern New England',
 'Orlando',
 'Philadelphia',
 'Phoenix Tucson',
 'Pittsburgh',
 'Plains',
 'Portland',
 'Raleigh Greensboro',
 'Richmond Norfolk',
 'Roanoke',
 'Sacramento',
 'San Diego',
 'San Francisco',
 'Seattle',
 'South Carolina',
 'South Central',
 'Southeast',
 'Spokane',
 'St Louis',
 'Syracuse',
 'Tampa',
 'Total U S',
 'West'}

In [38]:
export_csv = df.to_csv ('./output/AvocadoClean.csv', index=None, header=True)